<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="image_arrays" type="Parameter" version="opset1">
			<data shape="1,3,640,640" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image_arrays">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_8958" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8400, 2" offset="0" size="67200" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8400</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="backbone.stem.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="67200" size="2592" />
			<output>
				<port id="0" precision="FP32" names="backbone.stem.rbr_reparam.weight">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/backbone/stem/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_137" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="69792" size="96" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/backbone/stem/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/backbone/stem/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stem/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="backbone.ERBlock_2.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 24, 3, 3" offset="69888" size="41472" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_2.0.rbr_reparam.weight">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/backbone/ERBlock_2/ERBlock_2.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="111360" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/ERBlock_2/ERBlock_2.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/backbone/ERBlock_2/ERBlock_2.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="backbone.ERBlock_2.1.conv1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 3, 3" offset="111552" size="82944" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_2.1.conv1.rbr_reparam.weight">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/ERBlock_2/ERBlock_2.1/conv1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_235" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="194496" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/ERBlock_2/ERBlock_2.1/conv1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.1/conv1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/ERBlock_2/ERBlock_2.1/conv1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.1/conv1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="backbone.ERBlock_2.1.block.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 3, 3" offset="194688" size="82944" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_2.1.block.0.rbr_reparam.weight">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/ERBlock_2/ERBlock_2.1/block/block.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Reshape_284" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="277632" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/ERBlock_2/ERBlock_2.1/block/block.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.1/block/block.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/backbone/ERBlock_2/ERBlock_2.1/block/block.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_2/ERBlock_2.1/block/block.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="backbone.ERBlock_3.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 48, 3, 3" offset="277824" size="165888" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_3.0.rbr_reparam.weight">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/ERBlock_3/ERBlock_3.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_333" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="443712" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/backbone/ERBlock_3/ERBlock_3.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/ERBlock_3/ERBlock_3.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="backbone.ERBlock_3.1.conv1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="444096" size="331776" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_3.1.conv1.rbr_reparam.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/backbone/ERBlock_3/ERBlock_3.1/conv1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_382" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="775872" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/ERBlock_3/ERBlock_3.1/conv1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/conv1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/ERBlock_3/ERBlock_3.1/conv1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/conv1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="backbone.ERBlock_3.1.block.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="776256" size="331776" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_3.1.block.0.rbr_reparam.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_431" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1108032" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="backbone.ERBlock_3.1.block.1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="1108416" size="331776" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_3.1.block.1.rbr_reparam.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_480" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1440192" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="backbone.ERBlock_3.1.block.2.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 3, 3" offset="1440576" size="331776" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_3.1.block.2.rbr_reparam.weight">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.2/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_529" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="1772352" size="384" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.2/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.2/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone/ERBlock_3/ERBlock_3.1/block/block.2/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_3/ERBlock_3.1/block/block.2/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="backbone.ERBlock_4.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 96, 3, 3" offset="1772736" size="663552" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.0.rbr_reparam.weight">
					<dim>192</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/ERBlock_4/ERBlock_4.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_578" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="2436288" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/backbone/ERBlock_4/ERBlock_4.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/ERBlock_4/ERBlock_4.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="backbone.ERBlock_4.1.conv1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="2437056" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.conv1.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/ERBlock_4/ERBlock_4.1/conv1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Reshape_627" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="3764160" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/ERBlock_4/ERBlock_4.1/conv1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/conv1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/ERBlock_4/ERBlock_4.1/conv1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/conv1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="backbone.ERBlock_4.1.block.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="3764928" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.block.0.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_676" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="5092032" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="backbone.ERBlock_4.1.block.1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="5092800" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.block.1.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_725" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="6419904" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="backbone.ERBlock_4.1.block.2.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="6420672" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.block.2.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.2/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Reshape_774" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="7747776" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.2/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.2/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.2/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.2/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="backbone.ERBlock_4.1.block.3.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="7748544" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.block.3.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.3/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_823" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="9075648" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.3/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.3/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.3/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.3/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="backbone.ERBlock_4.1.block.4.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 3, 3" offset="9076416" size="1327104" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_4.1.block.4.rbr_reparam.weight">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.4/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_872" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="10403520" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.4/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.4/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/ERBlock_4/ERBlock_4.1/block/block.4/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_4/ERBlock_4.1/block/block.4/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="backbone.ERBlock_5.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 192, 3, 3" offset="10404288" size="2654208" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_5.0.rbr_reparam.weight">
					<dim>384</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/ERBlock_5/ERBlock_5.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>192</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Reshape_921" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="13058496" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/ERBlock_5/ERBlock_5.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/ERBlock_5/ERBlock_5.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="backbone.ERBlock_5.1.conv1.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384, 3, 3" offset="13060032" size="5308416" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_5.1.conv1.rbr_reparam.weight">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/ERBlock_5/ERBlock_5.1/conv1/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_970" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="18368448" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/ERBlock_5/ERBlock_5.1/conv1/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.1/conv1/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/ERBlock_5/ERBlock_5.1/conv1/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.1/conv1/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="backbone.ERBlock_5.1.block.0.rbr_reparam.weight" type="Const" version="opset1">
			<data element_type="f32" shape="384, 384, 3, 3" offset="18369984" size="5308416" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_5.1.block.0.rbr_reparam.weight">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/ERBlock_5/ERBlock_5.1/block/block.0/rbr_reparam/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1019" type="Const" version="opset1">
			<data element_type="f32" shape="1, 384, 1, 1" offset="23678400" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/backbone/ERBlock_5/ERBlock_5.1/block/block.0/rbr_reparam/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.1/block/block.0/rbr_reparam/Conv_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/ERBlock_5/ERBlock_5.1/block/block.0/nonlinearity/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.1/block/block.0/nonlinearity/Relu_output_0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="backbone.ERBlock_5.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f32" shape="192, 384, 1, 1" offset="23679936" size="294912" />
			<output>
				<port id="0" precision="FP32" names="backbone.ERBlock_5.2.cv1.conv.weight">
					<dim>192</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/backbone/ERBlock_5/ERBlock_5.2/cv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Reshape_1068" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="23974848" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/ERBlock_5/ERBlock_5.2/cv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/ERBlock_5/ERBlock_5.2/cv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
